homework2/WeatherFromIPCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://j2ee.netbeans.org/wsdl/WeatherFromIP/src/ClientWSDL">
  <soapenv:Body>
    <cli:ClientWSDLOperation>
      <inputIPaddress>131.114.3.24</inputIPaddress>
    </cli:ClientWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>